---
id: "557830"
date: 2021-05-18
title: "Cypress и его место в нашей тестовой пирамиде"
image: "https://habrastorage.org/r/w1560/getpro/habr/upload_files/e9e/394/d90/e9e394d90586efccbad372954bd8689d.png"
---

Стабильность и&nbsp;скорость ― это&nbsp;то, что ожидается от&nbsp;автотестов. 
В&nbsp;этой статье я&nbsp;расскажу о&nbsp;нашей стратегии по&nbsp;оптимизации тестовой пирамиды, 
о&nbsp;том, почему мы&nbsp;сделали выбор в&nbsp;пользу Cypress и&nbsp;какие выработали подходы к&nbsp;написанию тестов, 
а&nbsp;также о&nbsp;запуске тестов на&nbsp;инфраструктуре AWS.
